{
    "version": "https://jsonfeed.org/version/1",
    "title": "Kushal Arya, Full-stack Cloud Developer Blog",
    "home_page_url": "https://kushalarya.com/blog",
    "description": "Kushal Arya, Full-stack Cloud Developer Blog",
    "items": [
        {
            "id": "https://kushalarya.com/blog/hello-world",
            "content_html": "<p>When it comes to social media, I'm definitely more a reader than a writer type of person. Recently I've felt a need to start creating content. Or, more like get back into doing it.</p>\n<p>The last time I had a blog was more than 15 years ago. As a teenager, I used to run the \"My IT News\" WordPress site with, as you may expect, news around IT - especially the new consumer electronics products. While it didn't have much attention (as far as I remember, around ~5k unique visitors per month), I enjoyed doing it. But I had plenty of time and energy back then. Today I'm struggling with both, so... I'm starting a new blog! That makes sense, right?</p>\n<h3 id=\"why-yet-another-blog\">Why yet another blog</h3>\n<p>Nowadays, everyone has their own blog. Do I really need to become another wannabe influencer?</p>\n<p>No. What I want to achieve is:</p>\n<ul>\n<li>structure my knowledge and record what I've learned recently,</li>\n<li>try out new ways to increase productivity, stay motivated and avoid burnout,</li>\n<li>improve my English (as a non-native English speaker),</li>\n<li>develop self-discipline, reduce procrastination, and, as a result, save time to do the things mentioned above.</li>\n</ul>\n<p>So, as you can see, it's mostly for me, but I hope you'll benefit from this as well.</p>\n<h3 id=\"what-to-expect\">What to expect</h3>\n<p>Well, definitely shorter, more concise blog posts, like this one.</p>\n<center><p><img alt=\"Ain&amp;#39;t nobody got time for that\" src=\"https://kushalarya.com/assets/images/aint-nobody-got-time-for-that-46173cde8ae04c41d9e0674258d080dd.gif\" width=\"220\" height=\"220\"> <br><small>source: <a href=\"https://tenor.com/\" target=\"_blank\">tenor.com</a></small></p></center>\n<p>While I have a few ideas for new blog posts in mind, I don't want to limit myself to just technical topics. Instead, I will probably touch on different areas of my interest, such as:</p>\n<ul>\n<li>full-stack technical topics related to the technologies I use (Go, Kubernetes, React.js, JavaScript, TypeScript, GraphQL, gRPC...),</li>\n<li>personal projects announcements,</li>\n<li>new talks announcements</li>\n<li>open source,</li>\n<li>cool projects and apps I stumbled upon,</li>\n<li>productivity,</li>\n<li>personal growth (i.e. soft skills),</li>\n<li>finance.</li>\n</ul>\n<p>Yup, that's a lot - but we'll see how it goes.</p>\n<p>At some point, I would also like to experiment with the form of the content. Videos, podcasts? Maybe one day...</p>",
            "url": "https://kushalarya.com/blog/hello-world",
            "title": "Hello, world.",
            "summary": "When it comes to social media, I'm definitely more a reader than a writer type of person. Recently I've felt a need to start creating content. Or, more like get back into doing it.",
            "date_modified": "2022-07-07T00:00:00.000Z",
            "author": {
                "name": "Kushal Arya",
                "url": "https://kushalarya.com"
            },
            "tags": [
                "shorts",
                "hello",
                "world",
                "introduction"
            ]
        }
    ]
}